-- Вставка данных в таблицу Владелец счёта
INSERT INTO account_owners (name) VALUES
('Иван Иванов'),
('Петр Петров'),
('Сергей Сергеев'),
('Анна Антонова'),
('Ольга Олегова'),
('Мария Маркина');

-- Вставка данных в таблицу Статус счёта
INSERT INTO account_statuses (name) VALUES
('Активный'),
('Заблокирован'),
('Закрыт');

-- Вставка данных в таблицу Счета
INSERT INTO accounts (balance, id_owner, id_status, created_at) VALUES
(1000.50, 1, 1, '2023-01-01 12:00:00'),
(2000.75, 2, 1, '2023-02-01 12:00:00'),
(1500.00, 3, 1, '2023-03-01 12:00:00'),
(3000.00, 4, 1, '2023-04-01 12:00:00'),
(2500.25, 5, 1, '2023-05-01 12:00:00'),
(1800.80, 6, 1, '2023-06-01 12:00:00'),
(1200.40, 1, 2, '2023-07-01 12:00:00');

-- Вставка данных в таблицу Платежи
INSERT INTO current_payments (source_account_id, destination_account_id, payment_date, amount) VALUES
(1, 2, '2023-09-01 10:00:00', 500.00),
(2, 3, '2023-09-02 11:00:00', 400.00),
(3, 4, '2023-09-03 12:00:00', 300.00),
(4, 5, '2023-09-04 13:00:00', 200.00),
(5, 6, '2023-09-05 14:00:00', 150.00),
(6, 1, '2023-09-06 15:00:00', 100.00),
(1, 3, '2023-09-07 16:00:00', 250.00),
(2, 4, '2023-09-08 17:00:00', 300.00),
(5, 1, '2023-09-09 18:00:00', 350.00),
(3, 2, '2023-09-10 19:00:00', 500.00);
